# THIS FILE CONTAINS ALL THE MESSAGES USED IN THE BOT
# YOU CAN EDIT THE MESSAGES AS YOU LIKE


class Msg:
    # START MESSAGE
    onstart = """
Привет! 👋
Я ваш дружелюбный бот, готовый добавить немного волшебства вашим изображениям! ✨🌟

📷 Я специализируюсь на загрузке изображений на Imgur.com — идеальную платформу для обмена визуальным контентом.

Что делает меня особенным:
🔒 Полная анонимность: Ваша конфиденциальность — мой приоритет. Я не храню и не передаю личную информацию.
🚫 Отсутствие логов: Ваши действия — только ваше дело, и я это уважаю.
🖼️ Без водяных знаков: Ваши изображения остаются чистыми и неизменными.
❌ Без рекламы: Никаких помех, только удобная работа.

Готовы начать? Просто отправьте мне изображение, и волшебство начнётся! Если потребуется помощь, не стесняйтесь обращаться. Приятного обмена изображениями! 🤖📸
"""

    # ABOUT MESSAGE
    onabout = """
🤖 Bot Name    : Imgur Bot
🔢 Bot Version : 1.0.0
👨‍💻 Developer   : @bruce_11
📮 Source Code : Imgur-Telegram-Bot
✍️ Language    : Python 3.11
📚 Library     : Pyrogram 2.0.106
📡 Server      : Ubuntu 22.04

Made with 💙 by @bruce_11
    """

    # HELP MESSAGE
    onhelp = """ 
Привет! 👋 Нужна помощь с нашим ботом? Вот краткая инструкция:

Начало работы:
Используйте команду /start, чтобы начать работу и получить приветствие от бота. 🎉

О нас:
Интересуетесь, что делает наш бот? Команда /about расскажет больше о наших возможностях. 🤖

Загрузка изображений:
Просто отправьте изображение боту, и он всё сделает за вас! Изображение будет загружено на Imgur, а вы получите ссылку. 📸➡️🔗

Мы ценим вашу безопасность и анонимность: бот не сохраняет и не передаёт личную информацию. Ваша работа с изображениями остаётся защищённой. 🔒

Остались вопросы? Не стесняйтесь задавать их, мы всегда рады помочь! 😊

Сделано с 💙 создателем @bruce_11

"""